{"paperId": "3f71378310cccfe42951940a868c4dfa96f91bb9", "title": "Polypharmacy and drug-drug interactions in HIV-infected subjects in the region of Madrid, Spain: a population-based study.", "abstract": "BACKGROUND\nDrug-drug interactions (DDIs) involving antiretrovirals (ARVs) tend to cause harm if unrecognized, especially in the context of multiple co-morbidity and polypharmacy.\n\n\nMETHODS\nA database linkage was established between the regional drug dispensing registry of Madrid and the Liverpool HIV DDI database (January-June 2017). Polypharmacy was defined as the use of ≥5 non-HIV medications, and DDIs were classified by a traffic-light ranking for severity. HIV-uninfected controls were also included.\n\n\nRESULTS\nA total of 22,945 patients living with HIV (PLWH) and 6,613,506 uninfected individuals had received medications. Antiretroviral therapy regimens were predominantly based on integrase inhibitors (51.96%). Polypharmacy was significantly higher in PLWH (32.94%) than uninfected individuals (22.16%; P<0.001), and this difference was consistently observed across all age strata except for individuals aged ≥75 years. Polypharmacy was more common in women than men in both PLWH and uninfected individuals. The prevalence of contraindicated combinations involving ARVs was 3.18%. Comedications containing corticosteroids, quetiapine, or antithrombotic agents were associated with the highest risk for red-flag DDI, and the use of raltegravir or dolutegravir-based antiretroviral therapy was associated with an adjusted odds ratio of 0.72 (95% confidence interval: 0.60 - 0.88; P=0.001) for red-flag DDI.\n\n\nCONCLUSIONS\nPolypharmacy was more frequent among PLWH across all age groups except those aged ≥75 years and was more common in women. The persistent detection of contraindicated medications in patients receiving ARVs suggests a likely disconnect between hospital and community prescriptions. Switching to alternative unboosted integrase regimens should be considered for patients with high risk of harm from DDIs.", "year": 2020, "publicationDate": "2020-07-11", "authors": [{"authorId": "1413811042", "name": "B. López-Centeno"}, {"authorId": "1413809069", "name": "Carlos Badenes-Olmedo"}, {"authorId": "1742274491", "name": "Á. Mataix-Sanjuan"}, {"authorId": "82831565", "name": "K. McAllister"}, {"authorId": "4627386", "name": "J. Bellón"}, {"authorId": "4795019", "name": "S. Gibbons"}, {"authorId": "7862074", "name": "P. Balsalobre"}, {"authorId": "1401579579", "name": "L. Pérez-Latorre"}, {"authorId": "46822107", "name": "J. Benedí"}, {"authorId": "4532955", "name": "C. Marzolini"}, {"authorId": "1413810436", "name": "Ainhoa Aranguren-Oyarzábal"}, {"authorId": "145564963", "name": "S. Khoo"}, {"authorId": "1417618813", "name": "M. J. Calvo-Alcántara"}, {"authorId": "144489853", "name": "J. Berenguer"}]}