{"paperId": "47e618a27c3d43318038c71f8928c630b1be1a73", "title": "Data Quality Barriers for Transparency in Public Procurement", "abstract": "Governments need to be accountable and transparent for their public spending decisions in order to prevent losses through fraud and corruption as well as to build healthy and sustainable economies. Open data act as a major instrument in this respect by enabling public administrations, service providers, data journalists, transparency activists, and regular citizens to identify fraud or uncompetitive markets through connecting related, heterogeneous, and originally unconnected data sources. To this end, in this article, we present our experience in the case of Slovenia, where we successfully applied a number of anomaly detection techniques over a set of open disparate data sets integrated into a Knowledge Graph, including procurement, company, and spending data, through a linked data-based platform called TheyBuyForYou. We then report a set of guidelines for publishing high quality procurement data for better procurement analytics, since our experience has shown us that there are significant shortcomings in the quality of data being published. This article contributes to enhanced policy making by guiding public administrations at local, regional, and national levels on how to improve the way they publish and use procurement-related data; developing technologies and solutions that buyers in the public and private sectors can use and adapt to become more transparent, make markets more competitive, and reduce waste and fraud; and providing a Knowledge Graph, which is a data resource that is designed to facilitate integration across multiple data silos by showing how it adds context and domain knowledge to machine-learning-based procurement analytics.", "year": 2022, "publicationDate": "2022-02-20", "authors": [{"authorId": "153750193", "name": "A. Soylu"}, {"authorId": "70053552", "name": "Óscar Corcho"}, {"authorId": "3170752", "name": "B. Elvesæter"}, {"authorId": "2134990618", "name": "Carlos Badenes-Olmedo"}, {"authorId": "2155715210", "name": "Francisco Yedro-Martínez"}, {"authorId": "101029936", "name": "Matej Kovacic"}, {"authorId": "2007932882", "name": "Matej Posinkovic"}, {"authorId": "2155714185", "name": "Mitja Medvešček"}, {"authorId": "52208399", "name": "Ian Makgill"}, {"authorId": "31951006", "name": "C. Taggart"}, {"authorId": "2927032", "name": "E. Simperl"}, {"authorId": "143759957", "name": "T. C. Lech"}, {"authorId": "66215591", "name": "D. Roman"}]}