{"paperId": "68675db08311f1dbef1138d74d338a667aad2e24", "title": "Less Lipoatrophy and Better Lipid Profile With Abacavir as Compared to Stavudine: 96-Week Results of a Randomized Study", "abstract": "Objective:To assess lipoatrophy, other toxicities, and efficacy associated with abacavir as compared with stavudine in HIV-infected antiretroviral-naive patients. Methods:This was a prospective, randomized, open trial, stratified by viral load and CD4 cell count, conducted January 2001 to July 2004. Two hundred thirty-seven adult patients with HIV infection initiating antiretroviral therapy were assigned to receive abacavir (n = 115) or stavudine (n = 122), both combined with lamivudine and efavirenz. The primary endpoint was the proportion of patients with lipoatrophy as assessed by physician and patient observation at 96 weeks. Results:A lower proportion of patients assigned to abacavir developed clinical signs of lipoatrophy (4.8% vs. 38.3%; P < 0.001). These observations were confirmed by anthropometric data. Dual energy x-ray absorptiometry (DEXA) scans performed in 57 patients showed significantly greater total limb fat loss in the stavudine arm (−1579 vs. 913 g; P < 0.001). The lipid profile in abacavir patients presented more favorable changes in the levels of triglycerides (P = 0.03), high-density lipoprotein cholesterol (HDLc; P < 0.001), and apolipoprotein A1 (P < 0.001) as well as in the ratio between total cholesterol and HDLc (P = 0.005). Throughout the study, a higher proportion of patients in the stavudine group received lipid-lowering agents as compared to the abacavir group (17% vs. 4%; P = 0.002). Similar virologic and immunologic responses were observed. Conclusions:Assuming the limitations inherent to clinical assessment, this study shows a notably weaker association of abacavir with lipoatrophy than stavudine. DEXA scans and anthropometric measurements supported the clinical findings. In addition, the lipid changes that occurred were more favorable in patients receiving abacavir.", "year": 2007, "publicationDate": "2007-02-01", "authors": [{"authorId": "4538630", "name": "D. Podzamczer"}, {"authorId": "39058283", "name": "E. Ferrer"}, {"authorId": "153283271", "name": "P. Sanchez"}, {"authorId": "11423701", "name": "J. Gatell"}, {"authorId": "144353441", "name": "M. Crespo"}, {"authorId": "13145067", "name": "C. Fisac"}, {"authorId": "3718341", "name": "M. Loncá"}, {"authorId": "144189316", "name": "J. Sanz"}, {"authorId": "5062063", "name": "J. Niubó"}, {"authorId": "5727965", "name": "S. Veloso"}, {"authorId": "145804103", "name": "J. Llibre"}, {"authorId": "2434187", "name": "P. Barrufet"}, {"authorId": "39087234", "name": "M. A. Ribas"}, {"authorId": "87777369", "name": "E. Merino"}, {"authorId": "152174325", "name": "E. Ribera"}, {"authorId": "1413932406", "name": "J. Martínez-Lacasa"}, {"authorId": "2055962679", "name": "C. Alonso"}, {"authorId": "143699494", "name": "M. Aranda"}, {"authorId": "51996599", "name": "F. Pulido"}, {"authorId": "144489853", "name": "J. Berenguer"}, {"authorId": "15193629", "name": "A. Delegido"}, {"authorId": "46615427", "name": "J. D. Pedreira"}, {"authorId": "13354363", "name": "A. Lérida"}, {"authorId": "144550587", "name": "R. Rubio"}, {"authorId": "119911607", "name": "L. D. Rio"}]}