{"paperId": "87b1e3c5f485efc52c8cdcf20fa0b63346e6d181", "title": "A Semantic Sensor Web for Environmental Decision Support Applications", "abstract": "Sensing devices are increasingly being deployed to monitor the physical world around us. One class of application for which sensor data is pertinent is environmental decision support systems, e.g., flood emergency response. For these applications, the sensor readings need to be put in context by integrating them with other sources of data about the surrounding environment. Traditional systems for predicting and detecting floods rely on methods that need significant human resources. In this paper we describe a semantic sensor web architecture for integrating multiple heterogeneous datasets, including live and historic sensor data, databases, and map layers. The architecture provides mechanisms for discovering datasets, defining integrated views over them, continuously receiving data in real-time, and visualising on screen and interacting with the data. Our approach makes extensive use of web service standards for querying and accessing data, and semantic technologies to discover and integrate datasets. We demonstrate the use of our semantic sensor web architecture in the context of a flood response planning web application that uses data from sensor networks monitoring the sea-state around the coast of England.", "year": 2011, "publicationDate": "2011-09-14", "authors": [{"authorId": "34071005", "name": "A. Gray"}, {"authorId": "144030350", "name": "J. Sadler"}, {"authorId": "144121902", "name": "O. Kit"}, {"authorId": "1792820", "name": "K. Kyzirakos"}, {"authorId": "1943226", "name": "M. Karpathiotakis"}, {"authorId": "1795889", "name": "Jean-Paul Calbimonte"}, {"authorId": "49193745", "name": "Kevin R. Page"}, {"authorId": "1398854351", "name": "R. García-Castro"}, {"authorId": "34879237", "name": "A. Frazer"}, {"authorId": "2445257", "name": "I. Galpin"}, {"authorId": "144779687", "name": "A. Fernandes"}, {"authorId": "1716510", "name": "N. Paton"}, {"authorId": "70053552", "name": "Óscar Corcho"}, {"authorId": "1746733", "name": "Manolis Koubarakis"}, {"authorId": "1708123", "name": "D. D. Roure"}, {"authorId": "144685851", "name": "K. Martinez"}, {"authorId": "1398348796", "name": "A. Gómez-Pérez"}]}