{"paperId": "9e2501b8e5da6e1627508c4eb321bf66eb41020e", "title": "Soluble ST2, a biomarker of fibrosis, is associated with multiple risk factors, chronic diseases and total mortality in the OPERA study", "abstract": "Abstract Several diseases have a deleterious fibrosis component. Biomarkers indicating potential clinical utility that reliably reflect the degree of fibrosis have been introduced, one of them being soluble suppression of tumorigenicity 2 (sST2). The aim of our study was to explore the association of cardiometabolic risk factors, different diseases and total mortality with biomarker sST2 and see, how fibrosis is portrayed in these conditions. In addition, we were interested to see if sST2 levels could predict fibrosis in the long-term (21 years). The Oulu Project Elucidating Risk of Atherosclerosis (OPERA) survey collected data on the same individuals in years 1991–1993 (baseline, n = 1045), 2013–2014 (follow-up, n = 600) and mortality data until year 2019. Smoking at baseline retained a significant association with sST2 levels reflecting fibrosis development 20 years later. In the multivariate model male gender, diabetes, quick-index, levels of alanine aminotransferase (ALAT), high-density lipoprotein (HDL) cholesterol and high-sensitivity C-reactive protein (hsCRP) were associated with elevated sST2 levels at the examination 2013–2014. sST2 levels were higher among subjects suffering from cardiovascular disease (p = .031), cancer (p = .021), mild cognitive decline (p = .046) and diabetes (p < .001). Total mortality was assessed by using the Cox proportional hazard survival model analysis. sST2 (log-transformed) was an independent predictor of total mortality (HR 9.4; 95% CI 2.8–31.4, p<.001) when age, gender, diabetes, smoking, quick-index, levels of ALAT, HDL-cholesterol and hsCRP were added as covariates. In addition, elevated levels indicated worse prognosis and predicted mortality.", "year": 2021, "publicationDate": "2021-04-01", "authors": [{"authorId": "2062736880", "name": "Y. Filali"}, {"authorId": "3550608", "name": "Y. Kesäniemi"}, {"authorId": "5452890", "name": "O. Ukkola"}]}